tutorials/multiRegion/CHT/solidQuenching2DWithJouleHeating/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

regionSolvers
{
    fluid       compressibleVoF;
    solid1      solid;
    solid2      solid;
}

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         75;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.99;

maxDi           10.0;

maxAlphaCo      1;

maxDeltaT       1;

// ************************************************************************* //
