tutorials/multiRegion/CHT/solidQuenching2DWithJouleHeating/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1e-3;

vertices
(
    (0  0  -1)
    (70 0  -1)
    (70 140 -1)
    (0  140 -1)

    (0  0   1)
    (70 0   1)
    (70 140  1)
    (0  140  1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (140 170 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    maxY
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    minX
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    maxX
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    minY
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    emptyPatch
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
