tutorials/multiRegion/CHT/solidQuenching2DWithJouleHeating/constant/fluid/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
DecayHeatSource
{
    type     heatSource;
    cellZone      fluid;
  //Q               5e3; // Heat source per unit volume [W/m3] (-> heatSource.C Foam::fv::heatsource::readCoeffs )
    q               5e3; // Total heat source [W]              (-> heatSource.C Foam::fv::heatsource::readCoeffs )
}
*/


DecayHeatSource
{

    type        coded;
    cellZone    fluid;
    field           e;
    
    codeAddSup
    #{
        Pout << " *** codeAddSup *** " << endl;
    #};
    
    codeAddRhoSup
    #{
        Pout << " *** codeAddRhoSup *** " << endl;
    #};
    
    codeAddAlphaRhoSup
    #{
        Pout << " *** codeAddAlphaRhoSup *** " << endl;
      //const Time& time = mesh().time();
      //const scalarField& V = mesh().V();
      //scalarField& heSource = eqn.source();
      //heSource += 1000.*sqr(time.value())*V;
    #};
}


// ************************************************************************* //

      //const volScalarField& alpha = mesh().lookupObject<volScalarField>("alpha.water");
      //const scalar Qvol = 1e6;
      //scalarField& source = eqn.source();
      //const scalarField& V = mesh().V();
      //forAll(source, celli)
      //{
      //    source[celli] += akpha[celli] * Qvol * V[celli];
      //}

  //jouleHeatingSourceCoeffs
  //{
  //    anisotropicElectricalConductivity no;

  //  // Optionally specify sigma as a function of temperature.
  //  // If not supplied, this will be read from the time directory.
  //  //  E.g.;
  //    //sigma           127599.8469;
  //    //
  //      sigma           table
  //      (
  //          (0           100.)
  //          (1000        300.)
  //      );
  //}
