tutorials/multiRegion/CHT/solidQuenching2DWithJouleHeating/constant/fluid/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
  //object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);
sigma 0.07;

// ************************************************************************* //
/*
sigma
{
    type    liquidProperties;
    phase   water;
}
sigmas
(
   (air water)     0.07
);
*/
