tutorials/multiRegion/CHT/solidQuenching2DWithJouleHeating/constant/solid2/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType          constSolidThermo;

rho
{
    type        uniform;
    value       8000;
}

Cv
{
    type        uniform;
    value       450;
}

kappa
{
    type        uniform;
    value       80;
}


// ************************************************************************* //
