tutorials/multiRegion/CHT/solidQuenching2DWithJouleHeating/0.orig/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    maxY
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
    }

    minX            { type noSlip; }
    maxX            { type noSlip; }
    minY            { type noSlip; }
    fluid_to_solid1 { type noSlip; }
    fluid_to_solid2 { type noSlip; }
    empty           { type  empty; }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
