tutorials/multiRegion/CHT/solidQuenching2DWithJouleHeating/0.orig/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    maxY
    {
        type            calculated;
        value           uniform 1e5;
    }

    ".*"
    {
        type            calculated;
        value           uniform 1e5;
    }

    "procBoundary.*"
    {
        type            processor;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
