tutorials/multiRegion/CHT/solidQuenching2DWithJouleHeating/0.orig/fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    maxY
    {
      //type            fixedValue;
      //value           uniform 0e5;
        type            prghTotalPressure;
        p0              $internalField;
    }

    ".*"
    {
        type            fixedFluxPressure;
        value           $internalField;
      //value           uniform 0;
    }

    "procBoundary.*"
    {
        type            processor;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
