tutorials/multiRegion/CHT/solidQuenching2DWithJouleHeating/0.orig/fluid/T.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    maxY
    {
        type            inletOutlet;
        value           uniform 300;
        inletValue      uniform 300;
    }

    minX
    {
        type            fixedValue;
        value           uniform 300;
    }
    maxX
    {
        type            fixedValue;
        value           uniform 300;
    }

    minY
    {
        type            fixedValue;
        value           uniform 300;
    }

    fluid_to_solid1
    {
        type            coupledTemperature;
        value           $internalField;
    }
    fluid_to_solid2
    {
        type            coupledTemperature;
        value           $internalField;
    }

    ".*"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
