tutorials/multiRegion/CHT/solidQuenching2DWithJouleHeating/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;

    limited         cellLimited Gauss linear 1;
    grad(U)         $limited;
    grad(k)         $limited;
    grad(omega)     $limited;
}

divSchemes
{
    default             none;
    div(phi,alpha)      Gauss interfaceCompression vanLeer 1;

    div(rhoPhi,U)       Gauss linearUpwind limited;

  //div(phi,U)          Gauss upwind;

  //energy              Gauss upwind;
  //div(phi,K)          Gauss linear;
  //div(phi,h)          $energy;

  //turbulence          Gauss upwind;
    turbulence          Gauss limitedLinear 1;
    div(alphaRhoPhi,e)  $turbulence;
    div(alphaRhoPhi,T)  Gauss upwind;
    div(rhoPhi,K)       $turbulence;
    div(phi,p)          $turbulence;
    div(phi,k)          $turbulence;
  //div(phi,epsilon)    $turbulence;
  //div(phi,R)          $turbulence;
  //div(R)              Gauss linear;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
  //laplacian(alpha,h) Gauss linear corrected;
    laplacian(jouleHeatingSource:sigma,jouleHeatingSource:V) Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
