tutorials/multiRegion/CHT/solidQuenching2DWithJouleHeating/system/createZonesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createZonesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Electrode1
{
    name    Electrode1CellSet;
    type    cellSet;
    action  new;
    source  boxToCell;
    box     (-1e-3 29e-3 -1) (4.77e-3 70e-3 1);
}
Electrode2
{
    name    Electrode2CellSet;
    type    cellSet;
    action  new;
    source  boxToCell;
    box     (65.23e-3 29e-3 -1) (71e-3 70e-3 1);
}

{
    name    solid1;
    type    cellZoneSet;
    action  new;
    source  setToCellZone;
    set     Electrode1CellSet;
}
{
    name    solid2;
    type    cellZoneSet;
    action  new;
    source  setToCellZone;
    set     Electrode2CellSet;
}

{
    name    bottomFluidCellSet;
    type    cellSet;
    action  new;
    source  cellToCell;
    set     Electrode1CellSet;
}
{
    name    bottomFluidCellSet;
    type    cellSet;
    action  add;
    source  cellToCell;
    set     Electrode2CellSet;
}

{
    name    bottomFluidCellSet;
    type    cellSet;
    action  invert;
}

{
    name    Fluid;
    type    cellZoneSet;
    action  new;
    source  setToCellZone;
    set     bottomFluidCellSet;
}


// ************************************************************************* //
